OdCmEntityColor.op_Equality(OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compares two entity color objects as integer values, and returns true when
their values are equal or false when their values are not equal.
\sa
Example of Working with the Entity ColorColor Functionality as an Integer-value

OdCmEntityColor.op_Assign(OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copies an entity color object specified on the right of the operator to the entity color
object specified on the left.
\sa
Example of Working with the Entity Color

OdCmEntityColor.#ctor(OdCmEntityColor.ColorMethod)
\details
Creates an entity color object and sets the specified color method for the
newly created entity color object.
\param colorMethod [in]  Color method.
\sa
Methods of the Color Definition

OdCmEntityColor.#ctor(OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a copy of an existing entity color object.
\param color [in]  The entity color object to be copied.